app/controllers/school_classes_controller.rb

DELETE FROM "school_classes" WHERE "school_classes"."id" = ?  [["id", 1]]
---
    def destroy
        @school_class.destroy